{
  "house_based_tips_en": {
    "1": [
      "Focus on yourself before attending to others.",
      "Start your day slowly to maintain a clear mind.",
      "Wear something comfortable to feel confident.",
      "Avoid rushing—let your natural energy guide you.",
      "Give attention to your mood and personal needs today."
    ],
    "2": [
      "Think twice before spending on non-essentials.",
      "Keep your speech calm and steady while talking.",
      "Review your expenses briefly before the day ends.",
      "Avoid emotional shopping or impulsive buying.",
      "Speak politely to maintain harmony at home."
    ],
    "3": [
      "Plan your tasks in short steps to stay focused.",
      "Keep communication clear and avoid overexplaining.",
      "Take a short walk to refresh your thoughts.",
      "Respond calmly even if messages feel overwhelming.",
      "Write down your priorities to avoid confusion."
    ],
    "4": [
      "Keep your home space tidy for emotional comfort.",
      "Avoid emotional overload—slow down your pace.",
      "Spend a few minutes alone to reset emotionally.",
      "Drink something warm to soothe inner tension.",
      "Keep family conversations gentle and peaceful."
    ],
    "5": [
      "Express your creativity without perfection pressure.",
      "Avoid unnecessary reactions in love-related matters.",
      "Give time to something that makes you happy.",
      "Stay lighthearted and avoid emotional overthinking.",
      "Take out a moment for relaxation or fun."
    ],
    "6": [
      "Eat light to maintain energy throughout the day.",
      "Complete small tasks first to build momentum.",
      "Avoid unnecessary stress—keep things simple.",
      "Take short breaks to prevent mental fatigue.",
      "Stay organized to reduce work pressure."
    ],
    "7": [
      "Listen before reacting in conversations.",
      "Keep your tone soft to maintain harmony.",
      "Give space to others if they seem overwhelmed.",
      "Avoid instant decisions in relationships.",
      "Focus on cooperation rather than winning arguments."
    ],
    "8": [
      "Pause before reacting to deep emotions.",
      "Give yourself quiet space to understand feelings.",
      "Avoid holding heavy thoughts all day.",
      "Reflect calmly instead of overthinking outcomes.",
      "Let go of what you cannot control today."
    ],
    "9": [
      "Stay open-minded to new thoughts and ideas.",
      "Avoid arguments over beliefs or opinions.",
      "Spend some time learning something new.",
      "Let your mind breathe before making big plans.",
      "Keep long-term expectations realistic today."
    ],
    "10": [
      "Keep your goals clear and avoid distractions.",
      "Handle responsibilities calmly and steadily.",
      "Avoid rushing tasks just to finish quickly.",
      "Maintain a professional tone in conversations.",
      "Organize your work area for better clarity."
    ],
    "11": [
      "Be selective in social interactions today.",
      "Avoid unnecessary involvement in group issues.",
      "Reach out only to people who uplift you.",
      "Stay open to good news or progress.",
      "Keep your expectations light in friendships."
    ],
    "12": [
      "Give yourself extra rest if your mind feels heavy.",
      "Avoid noisy or crowded environments today.",
      "Take a short break from screens.",
      "Let go of thoughts that drain your energy.",
      "Keep the day slow, peaceful, and simple."
    ]
  },

  "house_based_tips_hi": {
    "1": [
      "आज दूसरों से पहले खुद पर ध्यान दें।",
      "दिन को धीरे शुरू करें ताकि मन साफ़ रहे।",
      "कुछ आरामदायक पहनें ताकि आत्मविश्वास बना रहे।",
      "जल्दीबाज़ी से बचें—स्वाभाविक ऊर्जा को बहने दें।",
      "अपने मूड और ज़रूरतों को प्राथमिकता दें।"
    ],
    "2": [
      "गैर-ज़रूरी खर्च से पहले दो बार सोचें।",
      "बात करते समय स्वर को शांत और स्थिर रखें।",
      "दिन खत्म होने से पहले खर्चों की समीक्षा करें।",
      "भावनात्मक या impulsive खरीदारी से बचें।",
      "नम्रता से बोलें ताकि घर में सामंजस्य बना रहे।"
    ],
    "3": [
      "काम को छोटे कदमों में बाँटकर पूरा करें।",
      "बात सरल और स्पष्ट रखें—अनावश्यक समझाने से बचें।",
      "थोड़ी देर टहलें ताकि दिमाग ताज़ा रहे।",
      "संदेश भारी लगें तो भी शांत होकर जवाब दें।",
      "गड़बड़ी से बचने के लिए प्राथमिकताएँ लिख लें।"
    ],
    "4": [
      "घर की जगह को थोड़ा साफ़-सुथरा रखें ताकि मन शांत रहे।",
      "भावनात्मक दबाव से बचने के लिए धीरे चलें।",
      "कुछ मिनट अकेले बैठकर खुद को रीसेट करें।",
      "हल्का गर्म पेय लें ताकि तनाव कम हो।",
      "परिवार से बात करते समय नरमी रखें।"
    ],
    "5": [
      "क्रिएटिव काम बिना परफेक्शन के दबाव के करें।",
      "प्रेम संबंधों में अनावश्यक प्रतिक्रियाओं से बचें।",
      "कुछ ऐसा करें जो आपको खुशी देता है।",
      "हल्के-फुल्के मूड में रहें और ज्यादा न सोचें।",
      "आराम या मज़ेदार काम के लिए थोड़ा समय निकालें।"
    ],
    "6": [
      "ऊर्जा बनाए रखने के लिए हल्का भोजन करें।",
      "छोटे काम पहले पूरे करें ताकि गति बने।",
      "अनावश्यक तनाव से बचें—चीजें सरल रखें।",
      "मानसिक थकान रोकने के लिए छोटे ब्रेक लें।",
      "व्यवस्थित रहें ताकि काम का दबाव कम हो।"
    ],
    "7": [
      "बात करने से पहले ध्यान से सुनें।",
      "स्वर को नरम रखें ताकि रिश्तों में संतुलन रहे।",
      "दूसरों को स्पेस दें अगर वे परेशान दिखें।",
      "रिश्तों में तुरंत निर्णय लेने से बचें।",
      "जीतने की बजाय सहयोग पर ध्यान दें।"
    ],
    "8": [
      "गहरी भावनाओं पर प्रतिक्रिया देने से पहले ठहरें।",
      "अपने लिए शांत जगह बनाएं और भावनाओं को समझें।",
      "भारी विचारों को पूरे दिन मत ढोएं।",
      "अति-विश्लेषण की बजाय शांत होकर सोचें।",
      "जो नियंत्रण में नहीं है उसे छोड़ दें।"
    ],
    "9": [
      "नई सोच या विचारों के लिए खुला मन रखें।",
      "विश्वास या विचारों पर बहस से बचें।",
      "कुछ नया सीखने में थोड़ा समय दें।",
      "बड़े प्लान बनाने से पहले मन को सांस लेने दें।",
      "लंबी उम्मीदें आज हल्की रखें।"
    ],
    "10": [
      "लक्ष्य स्पष्ट रखें और ध्यान भटकने न दें।",
      "जिम्मेदारियाँ शांत और steady मन से निभाएँ।",
      "काम जल्दी खत्म करने के लिए जल्दबाज़ी न करें।",
      "बात करते समय पेशेवर स्वर रखें।",
      "काम की जगह को व्यवस्थित करें ताकि स्पष्टता रहे।"
    ],
    "11": [
      "आज सामाजिक बातचीत में चयनित रहें।",
      "समूह के अनावश्यक मुद्दों में न पड़ें।",
      "सिर्फ उन लोगों से जुड़ें जो आपको uplift करते हैं।",
      "अच्छी ख़बर या प्रगति के लिए खुले रहें।",
      "दोस्ती में उम्मीदें हल्की रखें।"
    ],
    "12": [
      "मन भारी लगे तो खुद को अतिरिक्त आराम दें।",
      "शोरगुल या भीड़भाड़ वाली जगहों से बचें।",
      "स्क्रीन से कुछ देर दूरी बनाएं।",
      "थकाने वाले विचारों को छोड़ने की कोशिश करें।",
      "दिन को शांत, धीमा और सरल रखें।"
    ]
  }
}
