{
  "aries": {
    "intro": "Dear {SIGN}, today feels nurturing and emotionally grounding.",
    "paragraph": "There is comfort in familiar routines, and leaning into them brings stability. Work progresses smoothly when you stay patient, and emotional bonds strengthen through small, thoughtful gestures. Physical well-being improves when you respect your limits, and mindful financial habits reduce unnecessary worry. The energy of the day feels warm, steady, and reassuring.",
    "tips": "💡 Stay close to what feels familiar and safe.",
    "lucky_color": "Sage Green",
    "lucky_number": "5"
  },
  "taurus": {
    "intro": "Dear {SIGN}, today encourages emotional honesty and gentle self-expression.",
    "paragraph": "You may feel more comfortable sharing your thoughts without fear of misunderstanding. Work-related matters benefit from clear communication, and emotional connections deepen through openness. Taking small breaks helps your body recharge, while keeping finances simple maintains peace of mind. The day supports emotional ease and quiet confidence.",
    "tips": "💡 Speak softly but honestly.",
    "lucky_color": "Blush Pink",
    "lucky_number": "6"
  },
  "gemini": {
    "intro": "Dear {SIGN}, today feels balanced, calm, and quietly reassuring.",
    "paragraph": "You may notice that when you stay present, tasks feel easier and less overwhelming. Work improves through steady effort, and emotional comfort grows through gentle reassurance. Paying attention to posture, breathing, and rest supports overall well-being, while disciplined spending keeps financial stress away. The day offers a sense of emotional stability and inner peace.",
    "tips": "💡 Stay present in each moment.",
    "lucky_color": "Warm Ivory",
    "lucky_number": "9"
  },
  "cancer": {
    "intro": "Dear {SIGN}, today brings a gentle sense of emotional reassurance and inner stability.",
    "paragraph": "You may feel more settled within yourself, which helps you approach daily responsibilities without unnecessary pressure. Work progresses smoothly when you trust your experience instead of seeking approval. Emotional bonds feel comforting, especially when you show care through small, consistent actions. Paying attention to rest and simple nourishment keeps your body relaxed, while mindful spending prevents future worries. The day feels quietly supportive, like a soft emotional anchor.",
    "tips": "💡 Trust what feels steady and true.",
    "lucky_color": "Light Coral",
    "lucky_number": "4"
  },
  "leo": {
    "intro": "Dear {SIGN}, today encourages emotional softness and thoughtful action.",
    "paragraph": "You may notice a desire to keep things simple and peaceful, which works in your favor. Work feels less demanding when you avoid overloading yourself, and emotional comfort grows through gentle reassurance rather than explanation. Taking care of your breathing and posture improves overall well-being, while practical financial habits help you feel secure. The energy of the day supports calm progress and emotional balance.",
    "tips": "💡 Choose ease over effort today.",
    "lucky_color": "Butter Yellow",
    "lucky_number": "1"
  },
  "virgo": {
    "intro": "Dear {SIGN}, today feels emotionally light yet quietly meaningful.",
    "paragraph": "You may find joy in small achievements and peaceful interactions. Work flows better when you stay focused on one task at a time, and emotional understanding deepens through patience. Gentle movement and proper hydration keep your energy stable, while avoiding unnecessary expenses protects your peace of mind. The day feels like a reminder that simplicity often brings the greatest comfort.",
    "tips": "💡 Celebrate small wins without hesitation.",
    "lucky_color": "Seafoam",
    "lucky_number": "7"
  },
  "libra": {
    "intro": "Dear {SIGN}, today carries a soothing and emotionally grounding energy.",
    "paragraph": "You may feel more in tune with your needs, allowing you to move through the day with confidence and calm. Work benefits from your steady presence, and emotional connections feel secure when you listen with empathy. Respecting your body’s limits helps maintain comfort, while controlled financial choices keep stress away. The overall mood of the day feels nurturing and steady.",
    "tips": "💡 Listen closely to your inner signals.",
    "lucky_color": "Dusty Blue",
    "lucky_number": "8"
  },
  "scorpio": {
    "intro": "Dear {SIGN}, today gently supports emotional maturity and clarity.",
    "paragraph": "You may feel more comfortable letting things unfold naturally instead of forcing outcomes. Work-related matters improve through patience, and emotional warmth grows through quiet understanding. Maintaining a relaxed routine keeps your body balanced, while avoiding impulsive spending strengthens financial confidence. The day feels calm, reassuring, and emotionally supportive.",
    "tips": "💡 Allow things to settle naturally.",
    "lucky_color": "Soft Lilac",
    "lucky_number": "2"
  },
  "sagittarius": {
    "intro": "Dear {SIGN}, today feels gentle and emotionally reassuring, helping you feel more at ease with yourself.",
    "paragraph": "You may notice a quiet confidence guiding your actions, allowing you to handle responsibilities without stress. Work matters improve when you focus on what is necessary and ignore outside noise. Emotional connections feel comforting, especially when you express care through patience rather than words. Giving attention to rest and balanced meals supports your physical well-being, while cautious spending keeps your mind peaceful. The day unfolds softly, offering emotional security and calm progress.",
    "tips": "💡 Stay close to what feels emotionally safe.",
    "lucky_color": "Soft Beige",
    "lucky_number": "5"
  },
  "capricorn": {
    "intro": "Dear {SIGN}, today encourages calm thinking and emotional steadiness.",
    "paragraph": "You may feel less affected by external pressures, making it easier to stay focused. Work flows smoothly when you rely on routine and avoid unnecessary changes. Emotional understanding grows when you listen patiently, and taking time to relax your mind prevents exhaustion. Financial decisions feel easier when you stick to familiar and practical choices. The overall energy feels stable and comforting.",
    "tips": "💡 Keep your approach simple and steady.",
    "lucky_color": "Olive Green",
    "lucky_number": "6"
  },
  "aquarius": {
    "intro": "Dear {SIGN}, today brings a soft sense of emotional clarity.",
    "paragraph": "You may find yourself naturally letting go of worries that no longer serve you. Work responsibilities feel manageable when you trust your pace, and emotional warmth increases through gentle reassurance. Paying attention to breathing and posture helps maintain comfort, while thoughtful handling of money avoids unnecessary tension. The day supports emotional ease and quiet confidence.",
    "tips": "💡 Release what feels heavy.",
    "lucky_color": "Pale Aqua",
    "lucky_number": "9"
  },
  "pisces": {
    "intro": "Dear {SIGN}, today feels peaceful and emotionally grounding.",
    "paragraph": "You may feel more present in your actions, which helps you complete tasks without pressure. Work benefits from steady attention, and emotional bonds strengthen through small, consistent care. Gentle movement and proper hydration keep your body balanced, while disciplined spending protects long-term comfort. The day offers a sense of inner stability and reassurance.",
    "tips": "💡 Stay present in what you are doing.",
    "lucky_color": "Sky Grey",
    "lucky_number": "3"
  }
}