{
  "aries": {
    "career": "You will work on new plans with enthusiasm, and your seniors will openly appreciate your efforts.",
    "love": "You will feel a new freshness in your relationships. Spending happy moments with your partner will deepen understanding and love. Good proposals may come for singles.",
    "health": "Your health will be good today. Start your day with exercise and nutritious food to stay energetic throughout.",
    "tips": "Begin your day with positive thinking and prayer, it will create a positive environment around you."
  },
  "taurus": {
    "career": "Some minor obstacles may arise at work, but with patience and a balanced approach, you will overcome them easily. Support from colleagues will be helpful.",
    "love": "Small arguments may arise in relationships, but with patience and open conversation, the atmosphere will improve.",
    "health": "Headache or fatigue may trouble you. Keep yourself hydrated and get enough sleep.",
    "tips": "Include red or pink in your outfit today, it will boost your confidence."
  },
  "gemini": {
    "career": "There will be momentum in work and new opportunities will come your way. Your confidence and work style will impress others.",
    "love": "Romantic bonds will grow stronger. Time spent with your partner or spouse will bring peace.",
    "health": "Health will remain normal, but avoid careless eating. Stay away from spicy foods.",
    "tips": "Light a lamp at a temple or your home shrine to make your day more auspicious."
  },
  "cancer": {
    "career": "You will get the chance to complete old projects, and your efforts will be recognized by seniors.",
    "love": "Sweetness will remain in relationships. Your partner will understand your thoughts and support you completely.",
    "health": "You may feel tired and weak, so focus on a balanced diet and sufficient sleep.",
    "tips": "Begin any important work by remembering Lord Ganesha."
  },
  "leo": {
    "career": "Your confidence and hard work will lead to excellent performance at work. Colleagues will also support you.",
    "love": "Love life will be joyful. Singles may find a compatible partner.",
    "health": "Health will be stable. Light exercise and yoga will help you stay energetic.",
    "tips": "Offer food to someone in need today, it will bring good fortune."
  },
  "virgo": {
    "career": "Sudden challenges may arise at work, so move forward with well-thought-out plans.",
    "love": "Disagreements may occur with your life partner. Handle the situation with patience and gentleness.",
    "health": "Stomach-related issues may trouble you. Eat light and easily digestible food.",
    "tips": "Offer water to the Sun in the morning."
  },
  "libra": {
    "career": "Your creative thinking will bring success at work. Your new ideas will impress everyone.",
    "love": "Trust and depth in relationships will grow. Spending time with your partner will be pleasant.",
    "health": "Stress will reduce and energy will remain high. Meditation and breathing exercises will be beneficial.",
    "tips": "Wearing white clothes will enhance positivity."
  },
  "scorpio": {
    "career": "You may face challenges at work, but your experience and wisdom will help you find solutions.",
    "love": "There may be misunderstandings in relationships. Handle the situation with patience and calmness.",
    "health": "You may face issues like blood pressure or headaches, so rest is important.",
    "tips": "Take blessings from an elder."
  },
  "sagittarius": {
    "career": "Progress will be seen in both job and business. New opportunities will prove beneficial.",
    "love": "Happiness in love life will increase. Appreciate your partner.",
    "health": "You will feel energetic today. Maintain a balanced diet.",
    "tips": "Donate clothes to someone in need."
  },
  "capricorn": {
    "career": "Your work will be appreciated in the office and you may receive a new project.",
    "love": "This is a time of stability and trust in relationships. You will receive full support from your partner.",
    "health": "Practice meditation and get enough sleep for mental peace.",
    "tips": "Begin your day by offering water to the Tulsi plant."
  },
  "aquarius": {
    "career": "Luck will be on your side and pending work will be completed.",
    "love": "Marriage proposals may come for singles. Love life will also be good.",
    "health": "You may face digestive issues. Eat light food.",
    "tips": "Wearing yellow will bring good fortune."
  },
  "pisces": {
    "career": "You will receive support from colleagues and your hard work will pay off.",
    "love": "Love and understanding will grow in relationships. Old misunderstandings will be resolved.",
    "health": "Both physical and mental energy will be better.",
    "tips": "Worship Lord Hanuman to gain strength."
  }
}