{
  "Aries": "आपका लग्न मेष राशि में उदित हो रहा है, जिससे आपका स्वभाव साहसी और आत्म-प्रेरित बनता है। यह {nakshatra} नक्षत्र, पद {pada} में स्थित है, जो आपके कार्य शुरू करने के ढंग में विशेष गुण जोड़ता है। मेष लग्न उत्साह, त्वरित परिणाम की चाह और आगे बढ़कर नेतृत्व करने की प्रवृत्ति देता है। {aspect_effects} समग्र रूप से, आप ऊर्जावान और दृढ़ दिखते हैं; बस जल्दबाजी और क्रोध पर ध्यान दें।",
  "Taurus": "आपका लग्न वृषभ राशि में उदित हो रहा है, जिससे आपका स्वभाव स्थिर, व्यावहारिक और सुविधा-प्रिय बनता है। यह {nakshatra} नक्षत्र, पद {pada} में स्थित है, जो आपके स्वाद, सुरक्षा और मूल्यों को परिष्कृत करता है। वृषभ लग्न धैर्य, इन्द्रियसुख और वित्तीय स्थिरता प्रदान करता है। {aspect_effects} समग्र रूप से, आप भरोसेमंद दिखते हैं; बस ज़िद और बदलाव से डरने से बचें।",
  "Gemini": "आपका लग्न मिथुन राशि में उदित हो रहा है, जिससे आपका स्वभाव जिज्ञासु, संवादशील और अनुकूलनशील बनता है। यह {nakshatra} नक्षत्र, पद {pada} में स्थित है, जो आपके सीखने, जुड़ने और बहुकार्य करने के ढंग को प्रभावित करता है। मिथुन लग्न मानसिक चपलता, हाज़िरजवाबी और विविधता की चाह देता है। {aspect_effects} समग्र रूप से, आप जीवंत और बहुमुखी दिखते हैं; बस ध्यान भटकने और अति-विचार से बचें।",
  "Cancer": "आपका लग्न कर्क राशि में उदित हो रहा है, जिससे आपका स्वभाव देखभाल करने वाला, अंतर्ज्ञानी और रक्षक बनता है। यह {nakshatra} नक्षत्र, पद {pada} में स्थित है, जो आपकी भावनात्मक संवेदनशीलता और पारिवारिक झुकाव को बढ़ाता है। कर्क लग्न कोमलता, पालन-पोषण और जड़ों से गहरा जुड़ाव देता है। {aspect_effects} समग्र रूप से, आप गर्मजोशी भरे और संवेदनशील दिखते हैं; बस मूड के उतार-चढ़ाव से सावधान रहें।",
  "Leo": "आपका लग्न सिंह राशि में उदित हो रहा है, जिससे आपका स्वभाव आत्मविश्वासी, अभिव्यक्तिपूर्ण और हृदय-प्रधान बनता है। यह {nakshatra} नक्षत्र, पद {pada} में स्थित है, जो आपके आकर्षण और रचनात्मक गौरव को और मजबूत करता है। सिंह लग्न करिश्मा, उदारता और सच्चे आत्म-प्रकाशन की चाह देता है। {aspect_effects} समग्र रूप से, आप प्रेरणादायी और प्रभावशाली दिखते हैं; बस अहंकार और नाटकीयता पर ध्यान दें।",
  "Virgo": "आपका लग्न कन्या राशि में उदित हो रहा है, जिससे आपका स्वभाव सतर्क, विश्लेषणात्मक और सेवा-भाव से युक्त बनता है। यह {nakshatra} नक्षत्र, पद {pada} में स्थित है, जो आपकी सूक्ष्म दृष्टि और दैनिक जीवन के ढंग को परिष्कृत करता है। कन्या लग्न व्यावहारिकता, सुधार और व्यवस्था की चाह देता है। {aspect_effects} समग्र रूप से, आप शांत और सक्षम दिखते हैं; बस पूर्णतावाद और आत्म-आलोचना से बचें।",
  "Libra": "आपका लग्न तुला राशि में उदित हो रहा है, जिससे आपका व्यक्तित्व संतुलन और सौंदर्य से परिपूर्ण बनता है। यह {nakshatra} नक्षत्र, पद {pada} में स्थित है, जो आपके आकर्षण, कूटनीति और सामाजिक सहजता को बढ़ाता है। तुला लग्न मोहक, न्यायप्रिय और सामंजस्य-प्रिय स्वभाव देता है। {aspect_effects} समग्र रूप से, आप संतुलित और सहयोगी दिखते हैं; बस अनिर्णय और लोगों को खुश करने की आदत से सावधान रहें।",
  "Scorpio": "आपका लग्न वृश्चिक राशि में उदित हो रहा है, जिससे आपका स्वभाव गहन, चुंबकीय और रूपांतरणकारी बनता है। यह {nakshatra} नक्षत्र, पद {pada} में स्थित है, जो आपकी अंतर्दृष्टि और भावनात्मक शक्ति को गहरा करता है। वृश्चिक लग्न दृढ़ता, रहस्यप्रियता और सत्य की खोज देता है। {aspect_effects} समग्र रूप से, आप दृढ़निश्चयी और रहस्यमयी दिखते हैं; बस नियंत्रण की प्रवृत्ति और अविश्वास से बचें।",
  "Sagittarius": "आपका लग्न धनु राशि में उदित हो रहा है, जिससे आपका स्वभाव आशावादी, विस्तारशील और सत्य-प्रेमी बनता है। यह {nakshatra} नक्षत्र, पद {pada} में स्थित है, जो आपके अन्वेषण, आस्था और दूरदर्शिता को प्रेरित करता है। धनु लग्न स्पष्टवादिता, हास्य और सीखने की चाह देता है। {aspect_effects} समग्र रूप से, आप खुले और प्रेरणादायी दिखते हैं; बस अति-उत्साह और अतिवाद से बचें।",
  "Capricorn": "आपका लग्न मकर राशि में उदित हो रहा है, जिससे आपका स्वभाव अनुशासित, रणनीतिक और कर्तव्यनिष्ठ बनता है। यह {nakshatra} नक्षत्र, पद {pada} में स्थित है, जो आपके लक्ष्य और दीर्घकालिक योजनाओं को केंद्रित करता है। मकर लग्न धैर्य, दृढ़ता और परिणाम-प्रधान दृष्टिकोण देता है। {aspect_effects} समग्र रूप से, आप परिपक्व और भरोसेमंद दिखते हैं; बस कठोरता और कार्य-जीवन असंतुलन से सावधान रहें।",
  "Aquarius": "आपका लग्न कुंभ राशि में उदित हो रहा है, जिससे आपका स्वभाव मौलिक, आदर्शवादी और समाज-प्रिय बनता है। यह {nakshatra} नक्षत्र, पद {pada} में स्थित है, जो आपके नवाचार और स्वतंत्र विचार को बढ़ाता है। कुंभ लग्न प्रगतिशील सोच, नेटवर्क और मानवता-सेवा की प्रवृत्ति देता है। {aspect_effects} समग्र रूप से, आप अनोखे और भविष्य-दृष्टा दिखते हैं; बस उदासीनता और विद्रोही स्वभाव से बचें।",
  "Pisces": "आपका लग्न मीन राशि में उदित हो रहा है, जिससे आपका स्वभाव करुणामय, कल्पनाशील और आध्यात्मिक झुकाव वाला बनता है। यह {nakshatra} नक्षत्र, पद {pada} में स्थित है, जो आपकी अंतर्ज्ञान, सहानुभूति और कलात्मक प्रवाह को गहरा करता है। मीन लग्न कोमलता, अनुकूलनशीलता और समृद्ध आंतरिक जीवन देता है। {aspect_effects} समग्र रूप से, आप दयालु और ग्रहणशील दिखते हैं; बस सीमाओं और पलायनवाद से सावधान रहें।"
}
