{
  "Aries": "Your Ascendant (Lagna) rises in the sign of Aries, shaping a direct, courageous and self-starting personality. It lies in the Nakshatra of {nakshatra}, Pada {pada}, adding a specific flavor to how you initiate things. Aries Lagna brings enthusiasm, impatience for results, and a strong need to lead from the front. {aspect_effects} Overall, you come across bold and action-oriented; just watch impulsive decisions and quick temper.",
  "Taurus": "Your Ascendant (Lagna) rises in the sign of Taurus, shaping a steady, practical and comfort-seeking personality. It lies in the Nakshatra of {nakshatra}, Pada {pada}, refining your sense of taste, security and values. Taurus Lagna gives perseverance, sensual appreciation and financial steadiness over time. {aspect_effects} Overall, you appear grounded and reliable; just watch stubbornness and resistance to change.",
  "Gemini": "Your Ascendant (Lagna) rises in the sign of Gemini, shaping a curious, communicative and adaptable personality. It lies in the Nakshatra of {nakshatra}, Pada {pada}, coloring how you learn, connect and multitask. Gemini Lagna brings mental agility, wit and a need for variety in daily life. {aspect_effects} Overall, you come across lively and versatile; just watch scattered focus and overthinking.",
  "Cancer": "Your Ascendant (Lagna) rises in the sign of Cancer, shaping a caring, intuitive and protective personality. It lies in the Nakshatra of {nakshatra}, Pada {pada}, tuning your emotional radar and family instincts. Cancer Lagna gives sensitivity, nurturing energy and strong attachment to roots. {aspect_effects} Overall, you appear warm and receptive; just watch mood fluctuations and over-clinging.",
  "Leo": "Your Ascendant (Lagna) rises in the sign of Leo, shaping a confident, expressive and heart-led personality. It lies in the Nakshatra of {nakshatra}, Pada {pada}, enhancing your stage presence and creative pride. Leo Lagna brings charisma, generosity and a desire to shine through authentic self-expression. {aspect_effects} Overall, you come across regal and inspiring; just watch ego defensiveness and drama spikes.",
  "Virgo": "Your Ascendant (Lagna) rises in the sign of Virgo, shaping an attentive, analytical and service-minded personality. It lies in the Nakshatra of {nakshatra}, Pada {pada}, sharpening your eye for detail and daily systems. Virgo Lagna brings practicality, refinement and a desire to improve what’s around you. {aspect_effects} Overall, you appear composed and competent; just watch perfectionism and self-critique.",
  "Libra": "Your Ascendant (Lagna) rises in the sign of Libra, shaping your self-expression, physical health and overall personality with balance and grace. It lies in the Nakshatra of {nakshatra}, Pada {pada}, adding aesthetics, diplomacy and social ease. Libra Lagna gives charm, fairness and a drive for harmony in ties. {aspect_effects} Overall, you come across poised and collaborative; just watch indecision and people-pleasing.",
  "Scorpio": "Your Ascendant (Lagna) rises in the sign of Scorpio, shaping an intense, magnetic and transformative personality. It lies in the Nakshatra of {nakshatra}, Pada {pada}, deepening your insight and emotional power. Scorpio Lagna brings resilience, privacy and a strong instinct for truth beneath the surface. {aspect_effects} Overall, you appear determined and enigmatic; just watch control issues and trust extremes.",
  "Sagittarius": "Your Ascendant (Lagna) rises in the sign of Sagittarius, shaping a hopeful, expansive and truth-seeking personality. It lies in the Nakshatra of {nakshatra}, Pada {pada}, fueling exploration, faith and big-picture vision. Sagittarius Lagna brings candor, humor and a love of learning or travel. {aspect_effects} Overall, you come across open and inspiring; just watch bluntness and overpromising.",
  "Capricorn": "Your Ascendant (Lagna) rises in the sign of Capricorn, shaping a disciplined, strategic and duty-conscious personality. It lies in the Nakshatra of {nakshatra}, Pada {pada}, focusing your ambition and long-term planning. Capricorn Lagna brings resilience, patience and respect for structure and results. {aspect_effects} Overall, you appear mature and reliable; just watch rigidity and work–life imbalance.",
  "Aquarius": "Your Ascendant (Lagna) rises in the sign of Aquarius, shaping an original, ideal-driven and community-minded personality. It lies in the Nakshatra of {nakshatra}, Pada {pada}, amplifying innovation and independent thought. Aquarius Lagna brings humanitarian aims, networks and love of progressive ideas. {aspect_effects} Overall, you come across unique and future-focused; just watch detachment and contrarian streaks.",
  "Pisces": "Your Ascendant (Lagna) rises in the sign of Pisces, shaping a compassionate, imaginative and spiritually-inclined personality. It lies in the Nakshatra of {nakshatra}, Pada {pada}, heightening intuition, empathy and artistic flow. Pisces Lagna brings gentleness, adaptability and a rich inner life. {aspect_effects} Overall, you appear kind and receptive; just watch boundaries and escapist tendencies."
}
